Tekla.Structures.Dialog.Localization.Util.PropertyLocalizer
The PropertyLocalizer class localizes properties.

Tekla.Structures.Dialog.Localization.Util.PropertyLocalizer.#ctor(System.String)
Creates a new instance of the localizer.
propertyName: The name of the property.

Tekla.Structures.Dialog.Localization.Util.PropertyLocalizer.Localize(Tekla.Structures.Dialog.Localization,System.Object)
Localizes the object with the given localization instance.
localization: The localization instance to be used.
obj: The object to be localized.